#include <stdio.h>  
#include <conio.h>  
#include<locale.h>
void main()
{
	setlocale(LC_ALL, "Russian");

	//ЛАБА 4


	//Составить программу, которая в зависимости от порядкового
	//номера месяца(1, 2, … 12) выводит на экран количество дней в этом месяце.
	// Год невисокосный(информация об этом вводится с клавиатуры).

	/*int vr;
	printf("Введите номер месяца (число от 1 до 12):\n ");
	scanf_s("%d", &vr);
	if (vr > 12)
	printf("Ошибка ввода данных");
	else
	{
	switch (vr)
	{
	case 1: case 3: case 5: case 7: case 8: case 10: case 12:
	printf("31");
	break;
	case 2:
	printf("28");
	break;
	case 4: case 6: case 9: case 11:
	printf("30");
	break;


	}
	}*/

	//Даны четыре вещественных числа.Определить сколько из них больше нуля
	/*
	float a, b, c, d;
	int x = 0;
	printf("введите 4 числа: \n");
	scanf_s("%f%f%f%f,&a,&b,&c,&d);

	if (a > 0)
	x++;
	if (b > 0)
	x++;
	if (c > 0)
	x++;
	if (d > 0)
	x++;

	printf("%d", x);*/

	/*Известен вес трех человек. определить одинаков ли их вес*/

	/* float a, b, c;
	int x = 0;
	printf("введите вес трех человек: \n");
	scanf_s("%f %f %f", &a, &b, &c);
	if (a == b && b == c)
	printf("Вес трех человек равен\n");
	else
	printf("Вес трех человек не равен\n");
	*/




	/*ЛАБА 5*/


	 //1. Составьте блок - схему алгоритма и программу вывода на экран всех трехзначных чисел, кратных 9.
	 /*for (int i = 100; i < 1000; i++) {
	 if (i % 9 == 0) {
	 printf("%d\n", i);
	 }
	 }*/

	 //2. Составьте блок - схему алгоритма и программу вычисления суммы всех трехзначных чисел, кратных 17.
	 /*int x = 0;
	 int i;
	 for (i = 100; i < 1000; i++) {
	 if (i % 17 == 0) {
	 x = x + i;
	 }
	 }
	 printf("%d\n", x);
	 */

	 //3. Составьте программу вывода на экран таблицы степеней 3^n где 0 <= n <= 10 .
	 /*double n = 0;
	 int q;
	 while (n <= 10) {
	 n = n + 1;
	 q=pow(3, n);
	 printf("%d\n", q);
	 }*/




	 //ЛАБА 6


	  /*1. В массиве действительных чисел есть только положительные и отрицательные элементы.
	  Вычислить произведение отрицательных элементов Р1 и произведение положительных элементов Р2.
	  Сравнить модуль Р2 с модулем Р1 указать, какое из произведений по модулю больше*/


	  //printf("Введите значения массива: \n");
	  //float t[5];
	  //float P1 = 0;
	  //float P2 = 0;

	  //for (int i = 0; i < 5; i++)
	  //{
	  //  scanf_s("%f", &t[i]);
	  //}

	  //for (int i = 0; i < 5; i++)
	  //{
	  //  if (t[i] >= 0)
	  //    P1 = P1 + t[i];
	  //  else
	  //    P2 = P2 + t[i];
	  //}

	  //if (abs(P1) > abs(P2))
	  //  printf("%.2f", P1);
	  //else
	  //  printf("%.2f", P2);





	  /*2. Дан массив, состоящий из натуральных чисел. Образовать новый массив, злементами которого будут злементы исходного массива, оканчивающиеся на цифру k.*/
	  /*printf("Введите k = ");
	  int k;
	  scanf_s("%d", &k);
	  printf("Введите значения массива: \n");
	  int t[5];
	  int n[5];

	  for (int i = 0; i < 5; i++)
	  {
	  scanf_s("%d", &t[i]);
	  }

	  for (int i = 0; i < 5; i++)
	  {
	  if (t[i] % 10 == k)
	  n[i] = t[i];
	  else
	  n[i] = 0;
	  }
	  for (int i = 0; i < 5; i++)
	  {
	  printf("%d\n", n[i]);
	  }*/






	  /*3. Составьте программу перемены местами в массиве В(N) третьего и предпоследнего элементов.*/

	  /*printf("Введите значения массива: \n");
	  int b[5];
	  int x = 4;

	  for (int i = 0; i < 5; i++)
	  {
	   scanf_s("%d", &b[i]);
	  }

	  b[2] = b[2] + b[x - 1];
	  b[x - 1] = b[2] - b[x - 1];
	  b[2] = b[2] - b[x - 1];


	  for (int i = 0; i < 5; i++)
	  {
	   printf("%d. %d\n", i, b[i]);
	  }*/





	_getch();
}